Python 3.9.7 (tags/v3.9.7:1016ef3, Aug 30 2021, 20:19:38) [MSC v.1929 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> #정수형
>>> a = 123
>>> a
123
>>> a = -178
>>> a
-178
>>> a = 0
>>> a
0
>>> #실수형
>>> a = 1.2
>>> a
1.2
>>> a = -3.45
>>> a
-3.45
>>> a = 4.24E10
>>> a
42400000000.0
>>> a = 4.24e-10
>>> a
4.24e-10
>>> #8진수와 16진수
>>> a = 0o177
>>> a
127
>>> a = 0x8ff
>>> a
2303
>>> b = 0xABC
>>> b
2748
>>> #사칙연산
>>> a = 3
>>> b = 4
>>> a + b
7
>>> a * b
12
>>> a / b
0.75
>>> #x의 y제곱을 나타내는 ** 연산자
>>> a = 3
>>> b = 4
>>> a ** b
81
>>> #나눗셈 후 나머지를 반환하는 % 연산자
>>> 7 % 3
1
>>> 3 % 7
3
>>> #나눗셈 후 몫을 반환하는 // 연산자
>>> 7 / 4
1.75
>>> 7 // 4
1
>>> #연습문제
>>> 14 // 3
4
>>> 14 % 3
2
>>> 